Integračný manuál eFORM/Externá zbernica (USR)/GetEFormTemplateMetaXML/eForm_GetEFormTemplateMetaXML_SOAP_V_1_0___REQ.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<s:Header>
		<ActivityId CorrelationId="02eb86f4-8e5d-45b8-805e-a9648bc0c06e" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">ba0ec706-4670-412a-a716-4c80a3ddd448</ActivityId>
		<VsDebuggerCausalityData xmlns="http://schemas.microsoft.com/vstudio/diagnostics/servicemodelsink">uIDPo1VmHQzwsEBOn+MesCEES28AAAAA6hgsHOX5qk+HZN5SaJz1oxCekdDnnMFKqIcKNhm+ASYACQAA</VsDebuggerCausalityData>
		<o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<u:Timestamp u:Id="_0">
				<u:Created>2014-11-18T22:13:08.639Z</u:Created>
				<u:Expires>2014-11-18T22:18:08.639Z</u:Expires>
			</u:Timestamp>
			<saml:Assertion ID="id-Tewd8frueH32MlChxxHEk-PLni4-" IssueInstant="2014-11-18T22:12:30Z" Version="2.0" xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:dsig="http://www.w3.org/2000/09/xmldsig#" xmlns:enc="http://www.w3.org/2001/04/xmlenc#" xmlns:x500="urn:oasis:names:tc:SAML:2.0:profiles:attribute:X500" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
......
			</saml:Assertion>
		</o:Security>
	</s:Header>
	<s:Body>
		<CallService xmlns="http://schemas.gov.sk/ServiceBus/service/1.0">
			<serviceClass>eForm_GetEFormTemplateMetaXML_SOAP_V_1_0</serviceClass>
			<serviceParameter i:type="a:GetEFormTemplateMetaXMLReq" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:a="http://schemas.gov.sk/ServiceBusServiceProvider/Ness/eFormProvider/1.0">
				<a:FormTemplate>
					<a:Identifier>DCOM_eDemokracia_ZiadostOVydanieVolicskehoPreukazuFO_sk</a:Identifier>
					<a:Version>
						<a:Major>1</a:Major>
						<a:Minor>0</a:Minor>
					</a:Version>
				</a:FormTemplate>
			</serviceParameter>
		</CallService>
	</s:Body>
</s:Envelope>
